IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/UART0_1.0.xml
    <register id="UART0_LINCNT" width="32" offset="0x1130" description="UART LIN Mode Counter Register">
        <bitfield id="LINCNT" description="16 bit up counter clocked by the functional clock of the UART." begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UART0_LINCTL" width="32" offset="0x1134" description="UART LIN Mode Control Register">
        <bitfield id="CTRENA" description="LIN Counter Enable. LIN counter will only count when enabled." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Counter disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Counter enabled"/>
        </bitfield>
        <bitfield id="ZERONE" description="Zero on negative Edge of RXD. When enabled the counter is set to 0 and starts counting on a negative edge of RXD" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Zero on negative edge disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Zero on negative edge enabled"/>
        </bitfield>
        <bitfield id="CNTRXLOW" description="Count while low Signal on RXD When counter is enabled and the signal on RXD is low, the counter increments." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Count while low Signal on UARTxRXD disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Count while low Signal on UARTxRXD enabled"/>
        </bitfield>
        <bitfield id="LINC0CAP" description="Capture Counter on negative RXD Edge. When enabled the counter value is captured to LINC0 register on each negative RXD edge. A LINC0 interrupt is triggered when enabled." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Capture counter on negative UARTxRXD edge disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Capture counter on negative UARTxRXD edge enabled"/>
        </bitfield>
        <bitfield id="LINC1CAP" description="Capture Counter on positive RXD Edge. When enabled the counter value is captured to LINC1 register on each positive RXD edge. A LINC1 interrupt is triggered when enabled." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Capture counter on positive UARTxRXD edge disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Capture counter on positive UARTxRXD edge enabled"/>
        </bitfield>
        <bitfield id="LINC0_MATCH" description="Counter Compare Match Mode  When this bit is set to 1 a counter compare match with LINC0 register triggers an LINC0 interrupt when enabled." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Counter compare match mode disabled (capture mode enabled)"/>
            <bitenum id="ENABLE" value="0x1" description="Counter compare match enabled (capture mode disabled)"/>
        </bitfield>
    </register>
    <register id="UART0_LINC0" width="32" offset="0x1138" description="UART LIN Mode Capture 0 Register">
        <bitfield id="DATA" description="16 Bit Capture / Compare Register 
Captures current LINCTR value on RXD falling edge and can generate a LINC0 interrupt when capture is enabled (LINC0CAP = 1).

If compare mode is enabled (LINC0_MATCH = 1), a counter match can generate a LINC0 interrupt." begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UART0_LINC1" width="32" offset="0x113C" description="UART LIN Mode Capture 1 Register">
        <bitfield id="DATA" description="16 Bit Capture / Compare Register 
Captures current LINCTR value on RXD rising edge and can generate a LINC1 interrupt when capture is enabled (LINC1CAP = 1)" begin="15" end="0" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="UART0_IRCTL" width="32" offset="0x1140" description="eUSCI_Ax IrDA Control Word Register">
        <bitfield id="IRTXPL" description="Transmit pulse length.
Pulse length t(PULSE) = (IRTXPLx + 1) / [2 * f(IRTXCLK)]
(IRTXCLK = functional clock of the UART)" begin="7" end="2" width="6" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0x3F" description="Highest possible value"/>
        </bitfield>
        <bitfield id="IRRXPL" description="IrDA receive input UCAxRXD polarity" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="HIGH" value="0x0" description="IrDA transceiver delivers a high pulse when a light pulse is seen"/>
            <bitenum id="LOW" value="0x1" description="IrDA transceiver delivers a low pulse when a light pulse is seen"/>
        </bitfield>
        <bitfield id="IREN" description="IrDA encoder/decoder enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="IrDA encoder/decoder disabled"/>
            <bitenum id="ENABLE" value="0x1" description="IrDA encoder/decoder enabled"/>
        </bitfield>
        <bitfield id="IRTXCLK" description="IrDA transmit pulse clock select" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="BITCLK" value="0x0" description="IrDA encode data is based on the functional clock."/>
            <bitenum id="BRCLK" value="0x1" description="IrDA encode data is based on the Baud Rate clock&lt; when select 8x oversampling, the IRTXPL cycle should less 8;  when select 16x oversampling, the IRTXPL cycle should less 16."/>
        </bitfield>
    </register>
